load-testing/configs/api-load-test.yml
config:
  target: 'http://localhost:8080'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm-up"
    # Normal load phase
    - duration: 300
      arrivalRate: 50
      name: "Normal Load"
    # Peak load phase
    - duration: 180
      arrivalRate: 200
      name: "Peak Load"
    # Cool-down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery-LoadTest/1.0'
  
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "Health Check Load Test"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasHeader: "content-type"
            - contentType: "application/json"

  - name: "Admin API Load Test"
    weight: 30
    flow:
      - get:
          url: "/api/v1/streams/list"
          headers:
            X-Admin-Key: "SUPER_SECURE_KEY"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "status"
            - equals:
              - "{{ status }}"
              - "success"

  - name: "OAuth Authentication Load Test"
    weight: 25
    flow:
      - get:
          url: "/api/v1/auth/google/login"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - get:
          url: "/api/v1/auth/google/callback?code=MOCK_AUTH_CODE"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "token"

  - name: "Stream Management Load Test"
    weight: 25
    flow:
      - post:
          url: "/api/v1/streams/start"
          headers:
            X-Admin-Key: "SUPER_SECURE_KEY"
          json:
            stream_id: "load-test-{{ $randomString() }}"
            stream_url: "rtmp://test.example.com/stream"
            username: "test_user"
            password: "test_pass"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - post:
          url: "/api/v1/streams/stop"
          headers:
            X-Admin-Key: "SUPER_SECURE_KEY"
          json:
            stream_id: "load-test-{{ $randomString() }}"
          expect:
            - statusCode: 200
            - contentType: "application/json"